[
  {
    "name": "gamepad-rxjs",
    "url": "https://github.com/bouc1620/gamepad-rxjs",
    "stars": 1,
    "webpage": "https://www.npmjs.com/package/gamepad-rxjs",
    "description": {
      "fr": "Un wrapper autour du Gamepad API qui expose les événements des boutons et des joysticks comme des Observables RxJS. Il convient aux configurations multi-joueurs, permettant de gérer de manière réactive les entrées discrètes et continues.",
      "en": "This package wraps the Gamepad API and exposes all inputs as RxJS Observables. It is suitable for multi-player setups, allowing developers to reactively handle changes in state and respond to both discrete and continuous inputs."
    },
    "keywords": {
      "fr": [
        "RxJS",
        "Gamepad API",
        "TypeScript",
        "package npm"
      ],
      "en": [
        "RxJS",
        "Gamepad API",
        "TypeScript",
        "npm package"
      ]
    }
  },
  {
    "name": "mordicus2",
    "url": "https://github.com/bouc1620/mordicus2",
    "stars": 1,
    "webpage": "https://bouc1620.itch.io/mordicus",
    "description": {
      "fr": "Une reproduction du jeu Mordicus paru au courant des années 1990 sur Vidéoway. Développé en TypeScript avec RxJS, il gère de manière réactive les animations et les entrées utilisateur autant au clavier que sur une manette de jeu. Le projet produit une application de bureau avec Electron.",
      "en": "A modern remake of the 1990s Vidéoway game Mordicus. Built in TypeScript with RxJS, it handles user inputs and screen animations reactively, supports gamepad and keyboard, and packages the game as a desktop app with Electron."
    },
    "keywords": {
      "fr": [
        "RxJS",
        "TypeScript",
        "Vite",
        "Electron"
      ],
      "en": [
        "RxJS",
        "TypeScript",
        "Vite",
        "Electron"
      ]
    }
  },
  {
    "name": "boss-rush-nes",
    "url": "https://github.com/bouc1620/boss-rush-nes",
    "stars": 0,
    "description": {
      "fr": "Un émulateur NES basique écrit en Rust, créé surtout pour apprendre le langage et comprendre le fonctionnement d’une NES.",
      "en": "A basic NES emulator written in Rust. The project was primarily created to explore Rust programming, while also providing a simple, hands-on example of how classic NES hardware can be emulated in software."
    },
    "keywords": {
      "fr": [
        "émulateur NES",
        "langage assembleur 6502",
        "opérations binaires",
        "audio APU"
      ],
      "en": [
        "NES emulator",
        "6502 Assembly",
        "bitwise operations",
        "APU audio"
      ]
    }
  },
  {
    "name": "faq-section-web-components",
    "url": "https://github.com/bouc1620/faq-section-web-components",
    "stars": 0,
    "description": {
      "fr": "Une section FAQ simple et accessible, avec animations en accordéon et navigation clavier, construite en Web Components.",
      "en": "A clean FAQ section built with Web Components, featuring accordion animations, keyboard navigation, and accessibility-focused UX."
    },
    "keywords": {
      "fr": [
        "Web Components",
        "CSS",
        "Shadow DOM",
        "A11y"
      ],
      "en": [
        "Web Components",
        "CSS",
        "Shadow DOM",
        "A11y"
      ]
    }
  },
  {
    "name": "css-dojo",
    "url": "https://github.com/bouc1620/css-dojo",
    "stars": 0,
    "description": {
      "fr": "Des mini-projets CSS pour expérimenter et progresser dans le langage.",
      "en": "A training ground for my CSS skills. Small challenges I set myself to try cool tricks and learn."
    },
    "keywords": {
      "fr": [
        "SCSS",
        "pnpm",
        "CSS Houdini",
        "règle @property",
        "filtres SVG"
      ],
      "en": [
        "SCSS",
        "pnpm",
        "CSS Houdini",
        "@property rule",
        "SVG filters"
      ]
    }
  },
  {
    "name": "IFT611",
    "url": "https://api.github.com/repos/bouc1620/IFT611",
    "description": {
      "fr": "Éditeur de texte collaboratif en temps réel réalisé dans un cadre académique, utilisant WebRTC (PeerJS) et WebAssembly pour la cohérence du document, écrit en C++ et compilé avec Emscripten.",
      "en": "Real-time collaborative text editor built as an academic project, using WebRTC (PeerJS) and WebAssembly for document consistency, written in C++ and compiled with Emscripten."
    },
    "keywords": {
      "fr": [
        "C++",
        "JavaScript",
        "Pug",
        "Emscripten",
        "Wasm",
        "WebRTC",
        "Pair-à-pair"
      ],
      "en": [
        "C++",
        "JavaScript",
        "Pug",
        "Emscripten",
        "Wasm",
        "WebRTC",
        "Peer-to-peer"
      ]
    }
  }
]